index.html

<!DOCTYPE html>
<html>
<head>
  <title>SOAP Request Example</title>
</head>
<body>

<button id="sendRequest">Send SOAP Request</button>
<div id="responseContainer"></div>

<script>
document.getElementById('sendRequest').addEventListener('click', function() {
  // Define the SOAP request XML
  var soapRequest = `
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.oorsprong.org/websamples.countryinfo">
   <soapenv:Header/>
   <soapenv:Body>
      <web:FullCountryInfoAllCountries/>
   </soapenv:Body>
</soapenv:Envelope>
  `;
  
  // Make the SOAP request using Fetch API
  fetch('http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso', {
    method: 'POST',
    headers: {
      'Content-Type': 'text/xml',
    },
    body: soapRequest,
  })
  .then(response => response.text())
  .then(data => {
    // Display the SOAP response in the responseContainer
    document.getElementById('responseContainer').innerText = data;
  })
  .catch(error => {
    console.error('Error:', error);
  });
});
</script>

</body>
</html>
